#### Terraform Format and Style: ✅
#### Terraform Initialization: ✅
#### Terraform Plan: ✅
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/tnfhhm-dev/runs/run-5EUHWy48R3AA7sGK

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.template_file.sample_app: Refreshing state... [id=54ebeac0255dca5b699f1bb957b9a4c0cc7a20f8ed9202f61d3c43a91080fe3e]
data.aws_availability_zones.available: Refreshing state... [id=ca-central-1]
data.aws_vpc.main: Refreshing state... [id=vpc-0b0b9feb7745e0f54]
data.aws_acm_certificate.sample_cert: Refreshing state... [id=arn:aws:acm:ca-central-1:813318847992:certificate/a366ad6d-94e6-4389-902b-48e925d72e35]
aws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]
aws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:813318847992:startup-sample-billing-alert-topic]
data.aws_iam_policy_document.ecs_task_execution_role: Refreshing state... [id=320642683]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:813318847992:cluster/sample-cluster]
aws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]
aws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]
aws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]
aws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20201205002324650200000001]
aws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]
aws_budgets_budget.cost: Refreshing state... [id=813318847992:startup-sample-monthly]
aws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]
data.aws_subnet_ids.privateapp: Refreshing state... [id=vpc-0b0b9feb7745e0f54]
aws_security_group.endpoints: Refreshing state... [id=sg-009997b71c698ffb7]
aws_security_group.lb: Refreshing state... [id=sg-01e17a428745aa913]
aws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:targetgroup/sample-target-group/6af35e159f98cb52]
data.aws_subnet_ids.private: Refreshing state... [id=vpc-0b0b9feb7745e0f54]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-0b2ba72c60a43096e]
aws_alb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:loadbalancer/app/sample-load-balancer/944bc381d63faa40]
aws_alb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener/app/sample-load-balancer/944bc381d63faa40/0239197f6b4c33ef]
aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:813318847992:service/sample-cluster/sample-service]
aws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]
aws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]
aws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]
aws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]
aws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_budgets_budget.cost will be updated in-place
  ~ resource "aws_budgets_budget" "cost" {
        account_id        = "813318847992"
        budget_type       = "COST"
        cost_filters      = {
            "TagKeyValue" = "user:Project$Startup Sample"
        }
        id                = "813318847992:startup-sample-monthly"
      ~ limit_amount      = "100.0" -> "100"
        limit_unit        = "USD"
        name              = "startup-sample-monthly"
        time_period_end   = "2087-06-15_00:00"
      ~ time_period_start = "2020-12-01_12:00" -> (known after apply)
        time_unit         = "MONTHLY"

        cost_types {
            include_credit             = true
            include_discount           = true
            include_other_subscription = true
            include_recurring          = true
            include_refund             = true
            include_subscription       = true
            include_support            = true
            include_tax                = true
            include_upfront            = true
            use_amortized              = false
            use_blended                = false
        }

        notification {
            comparison_operator        = "GREATER_THAN"
            notification_type          = "FORECASTED"
            subscriber_email_addresses = []
            subscriber_sns_topic_arns  = [
                "arn:aws:sns:ca-central-1:813318847992:startup-sample-billing-alert-topic",
            ]
            threshold                  = 75
            threshold_type             = "PERCENTAGE"
        }
    }

  # aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        cluster                            = "arn:aws:ecs:ca-central-1:813318847992:cluster/sample-cluster"
        deployment_maximum_percent         = 200
        deployment_minimum_healthy_percent = 100
      ~ desired_count                      = 1 -> 2
        enable_ecs_managed_tags            = true
        health_check_grace_period_seconds  = 60
        iam_role                           = "aws-service-role"
        id                                 = "arn:aws:ecs:ca-central-1:813318847992:service/sample-cluster/sample-service"
        name                               = "sample-service"
        platform_version                   = "LATEST"
        propagate_tags                     = "TASK_DEFINITION"
        scheduling_strategy                = "REPLICA"
        tags                               = {
            "Environment" = "Development"
            "Project"     = "Startup Sample"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task:15" -> (known after apply)
        wait_for_steady_state              = false

        capacity_provider_strategy {
            base              = 0
            capacity_provider = "FARGATE_SPOT"
            weight            = 100
        }

        deployment_controller {
            type = "ECS"
        }

        load_balancer {
            container_name   = "sample-client-app"
            container_port   = 80
            target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:813318847992:targetgroup/sample-target-group/6af35e159f98cb52"
        }

        network_configuration {
            assign_public_ip = false
            security_groups  = [
                "sg-0b2ba72c60a43096e",
            ]
            subnets          = [
                "subnet-0951fc68c574dd978",
                "subnet-0a47466d84edd8ef9",
            ]
        }
    }

  # aws_ecs_task_definition.app[0] must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task:15" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                    cpu              = 512
                    environment      = [
                        {
                            name  = "AWS_REGION"
                            value = "ca-central-1"
                        },
                        {
                            name  = "DB_NAME"
                            value = "ssp-greetings"
                        },
                    ]
                  - essential        = true -> null
                  ~ image            = "ghcr.io/wrnu/startup-sample-project:dev-401862079" -> "ghcr.io/wrnu/startup-sample-project:PR-4-401875760"
                    logConfiguration = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-create-group  = "true"
                            awslogs-group         = "/ecs/sample-app"
                            awslogs-region        = "ca-central-1"
                            awslogs-stream-prefix = "ecs"
                        }
                    }
                    memory           = 1024
                  - mountPoints      = [] -> null
                    name             = "sample-client-app"
                  ~ portMappings     = [
                      ~ {
                            containerPort = 80
                            hostPort      = 80
                          - protocol      = "tcp" -> null
                        },
                    ]
                  - volumesFrom      = [] -> null
                } # forces replacement,
            ]
        )
        cpu                      = "512"
        execution_role_arn       = "arn:aws:iam::813318847992:role/startupSampleEcsTaskExecutionRole"
        family                   = "sample-app-task"
      ~ id                       = "sample-app-task" -> (known after apply)
        memory                   = "1024"
        network_mode             = "awsvpc"
        requires_compatibilities = [
            "FARGATE",
        ]
      ~ revision                 = 15 -> (known after apply)
        tags                     = {
            "Environment" = "Development"
            "Project"     = "Startup Sample"
        }
        task_role_arn            = "arn:aws:iam::813318847992:role/sample_app_container_role"
    }

Plan: 1 to add, 2 to change, 1 to destroy.

------------------------------------------------------------------------

Cost estimation:

Resources: 4 of 6 estimated
           $17.34224516129032272/mo +$0.0

```

</details>

*Pusher:* @wrnu, *Action:* [CI/CD: #49](https://github.com/wrnu/startup-sample-project/actions/runs/401875760)